
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СообщитьSOS(Команда)
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = СообщениеСигналаБедствия();
	Сообщение.Сообщить();	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьХарактеристикуЖизни(Жив)

	Жив = ?(Жив = Истина, "ЖИВ", "НЕ_ЖИВ");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДопИнфо(Галактика, Доминанта, Спектр)

	Возврат Новый Структура("Г, Д, Е", Галактика, Доминанта, Спектр);

КонецФункции

&НаСервере
Функция СообщениеСигналаБедствия()

	Жив = Истина;
	УстановитьХарактеристикуЖизни(Жив);

	Координаты = КоординатыГалактическойНавигации(Истина);

	Галактика = "все" + "све" + "есв";
	Доминанта = СтрШаблон(НСтр("ru = 'трансквартирное %1'"), НСтр("ru = 'выравнивание'"));
	Спектр = "Бу" + "Га" + "Га";
	
	ДопИнфо = ДопИнфо(Галактика, Доминанта, Спектр);

	Пакет = Новый Структура("Жив, Координаты, ДопИнфо", Жив, Координаты, ДопИнфо);

	Пакет.Жив = Пакет.Жив + "_ПРОВЕРЕНО";
	
	Возврат КоннекторHTTP.ОбъектВJson(Пакет);

КонецФункции

&НаСервере
Функция КоординатыГалактическойНавигации(ФлажокУправления = Истина)
	
	Если ФлажокУправления Тогда 
		Ответ = КоннекторHTTP.Get("https://ya.ru");
	Иначе
		Ответ = КоннекторHTTP.Get("https://narod.ru");
	КонецЕсли;
	
	Возврат XMLСтрока(Ответ.Заголовки["X-Yandex-Req-Id"]);
	
КонецФункции

#КонецОбласти
